Revit 2026 API

# PaperSizeSetIterator Class

---

An iterator to a set of paper size objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPaperSizeSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class PaperSizeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class PaperSizeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class PaperSizeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type PaperSizeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The PaperSizeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PaperSizeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace